tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67k22_tdd.h
#define CTMUEN                        522
#define ALRMVALL                      523
#define ALRMVALH                      524
#define ALRMRPT                       525
#define ARPT0                         526
#define ARPT                          527
#define ARPT1                         528
#define ARPT2                         529
#define ARPT3                         530
#define ARPT4                         531
#define ARPT5                         532
#define ARPT6                         533
#define ARPT7                         534
#define ALRMCFG                       535
#define ALRMPTR                       536
#define ALRMPTR0                      537
#define ALRMPTR1                      538
#define AMASK0                        539
#define AMASK                         540
#define AMASK1                        541
#define AMASK2                        542
#define AMASK3                        543
#define CHIME                         544
#define ALRMEN                        545
#define RTCVALL                       546
#define WAITE0                        547
#define RTCVALH                       548
#define WAITE1                        549
#define WAITM0                        550
#define WAITM1                        551
#define WAITM2                        552
#define WAITM3                        553
#define WAITB0                        554
#define WAITB1                        555
#define RTCCAL                        556
#define CAL0                          557
#define CAL                           558
#define CAL1                          559
#define CAL2                          560
#define CAL3                          561
#define CAL4                          562
#define CAL5                          563
#define CAL6                          564
#define CAL7                          565
#define RTCCFG                        566
#define RTCPTR0                       567
#define RTCPTR                        568
#define RTCPTR1                       569
#define RTCOE                         570
#define HALFSEC                       571
#define RTCSYNC                       572
#define RTCWREN                       573
#define RTCEN                         574
#define PIE6                          575
#define CMP1IE                        576
#define CMP2IE                        577
#define CMP3IE                        578
#define EEIE                          579
#define EEDATA                        580
#define EEADR                         581
#define EEADRH                        582
#define OSCCON2                       583
#define MFIOSEL                       584
#define MFIOFS                        585
#define SOSCGO                        586
#define SOSCRUN                       587
#define BAUDCON1                      588
#define BAUDCON1_ABDEN                589
#define ABDEN1                        590
#define BAUDCON1_WUE                  591
#define WUE1                          592
#define W4E                           593
#define BRG161                        594
#define BAUDCON1_BRG16                595
#define CKTXP                         596
#define BAUDCON1_TXCKP                597
#define SCKP1                         598
#define TXCKP1                        599
#define SCKP                          600
#define DTRXP1                        601
#define RXDTP1                        602
#define DTRXP                         603
#define RXCKP                         604
#define BAUDCON1_RXDTP                605
#define RCMT1                         606
#define RCIDL1                        607
#define BAUDCON1_RCIDL                608
#define RCMT                          609
#define ABDOVF1                       610
#define BAUDCON1_ABDOVF               611
#define SSP2CON2                      612
#define SEN2                          613
#define SSP2CON2_SEN                  614
#define ADMSK12                       615
#define SSP2CON2_RSEN                 616
#define RSEN2                         617
#define SSP2CON2_ADMSK1               618
#define ADMSK22                       619
#define PEN2                          620
#define SSP2CON2_PEN                  621
#define SSP2CON2_ADMSK2               622
#define ADMSK32                       623
#define SSP2CON2_RCEN                 624
#define RCEN2                         625
#define SSP2CON2_ADMSK3               626
#define ACKEN2                        627
#define ADMSK42                       628
#define SSP2CON2_ADMSK4               629
#define SSP2CON2_ACKEN                630
#define ACKDT2                        631
#define ADMSK52                       632
#define SSP2CON2_ACKDT                633
#define SSP2CON2_ADMSK5               634
#define SSP2CON2_ACKSTAT              635
#define ACKSTAT2                      636
#define SSP2CON2_GCEN                 637
#define GCEN2                         638
#define SSP2CON1                      639
#define SSP2CON1_SSPM                 640
#define SSP2CON1_SSPM0                641
#define SSPM02                        642
#define SSPM12                        643
#define SSP2CON1_SSPM1                644
#define SSP2CON1_SSPM2                645
#define SSPM22                        646
#define SSPM32                        647
#define SSP2CON1_SSPM3                648
#define SSP2CON1_CKP                  649
#define CKP2                          650
#define SSPEN2                        651
#define SSP2CON1_SSPEN                652
#define SSPOV2                        653
#define SSP2CON1_SSPOV                654
#define WCOL2                         655
#define SSP2CON1_WCOL                 656
#define SSP2STAT                      657
#define SSP2STAT_BF                   658
#define BF2                           659
#define SSP2STAT_UA                   660
#define UA2                           661
#define SSP2STAT_R_W                  662
#define SSP2STAT_I2C_READ             663
#define RW2                           664
#define SSP2STAT_R                    665
#define SSP2STAT_nW                   666
#define READ_WRITE2                   667
#define nW2                           668
#define SSP2STAT_nWRITE               669
#define I2C_READ2                     670
#define SSP2STAT_R_NOT_W              671
#define R_nW2                         672
#define SSP2STAT_READ_WRITE           673
#define nWRITE2                       674
#define R_W2                          675
#define SSP2STAT_R_nW                 676
#define SSP2STAT_NOT_WRITE            677
#define SSP2STAT_S                    678
#define S2                            679
#define START2                        680
#define SSP2STAT_I2C_START            681
#define I2C_START2                    682
#define P2                            683
#define SSP2STAT_I2C_STOP             684
#define SSP2STAT_P                    685
#define STOP2                         686
#define I2C_STOP2                     687
#define I2C_DAT2                      688
#define SSP2STAT_D                    689
#define DATA_ADDRESS2                 690
#define SSP2STAT_D_NOT_A              691
#define SSP2STAT_I2C_DAT              692
#define D_A2                          693
#define SSP2STAT_NOT_ADDRESS          694
#define SSP2STAT_D_nA                 695
#define SSP2STAT_DATA_ADDRESS         696
#define SSP2STAT_nADDRESS             697
#define nA2                           698
#define DA2                           699
#define nADDRESS2                     700
#define D_nA2                         701
#define SSP2STAT_nA                   702
#define SSP2STAT_D_A                  703
#define SSP2STAT_CKE                  704
#define CKE2                          705
#define SSP2STAT_SMP                  706
#define SMP2                          707
#define MSK02                         708
#define SSP2ADD                       709
#define MSK12                         710
#define MSK22                         711
#define MSK32                         712
#define MSK42                         713
#define MSK52                         714
#define MSK62                         715
#define MSK72                         716
#define SSP2MSK                       717
#define SSP2MSK_MSK0                  718
#define SSP2MSK_MSK1                  719
#define SSP2MSK_MSK2                  720
#define SSP2MSK_MSK3                  721
#define SSP2MSK_MSK4                  722
#define SSP2MSK_MSK5                  723
#define SSP2MSK_MSK6                  724
#define SSP2MSK_MSK7                  725
#define SSP2BUF                       726
#define T4CON                         727
#define T4CKPS0                       728
#define T4CKPS                        729
#define T4CKPS1                       730
#define TMR4ON                        731
#define T4OUTPS                       732
#define T4OUTPS0                      733
#define T4OUTPS1                      734
#define T4OUTPS2                      735
#define T4OUTPS3                      736
#define PR4                           737
#define TMR4                          738
#define CCP7CON                       739
#define CCP7M0                        740
#define CCP7M                         741
#define CCP7M1                        742
#define CCP7M2                        743
#define CCP7M3                        744
#define DC7B                          745
#define CCP7Y                         746
#define DC7B0                         747
#define CCP7X                         748
#define DC7B1                         749
#define CCPR7L                        750
#define CCPR7H                        751
#define CCP6CON                       752
#define CCP6M                         753
#define CCP6M0                        754
#define CCP6M1                        755
#define CCP6M2                        756
#define CCP6M3                        757
#define CCP6Y                         758
#define DC6B0                         759
#define DC6B                          760
#define DC6B1                         761
#define CCP6X                         762
#define CCPR6L                        763
#define CCPR6H                        764
#define CCP5CON                       765
#define CCP5M0                        766
#define CCP5M                         767
#define CCP5M1                        768
#define CCP5M2                        769
#define CCP5M3                        770
#define CCP5Y                         771
#define DC5B0                         772
#define DC5B                          773
#define CCP5X                         774
#define DC5B1                         775
#define CCPR5L                        776
#define CCPR5H                        777
#define CCP4CON                       778
#define CCP4M                         779
#define CCP4M0                        780
#define CCP4M1                        781
#define CCP4M2                        782
#define CCP4M3                        783
#define CCP4Y                         784
#define DC4B0                         785
#define DC4B                          786
#define CCP4X                         787
#define DC4B1                         788
#define CCPR4L                        789
#define CCPR4H                        790
#define T5GCON                        791
#define T5GSS                         792
#define T5GSS0                        793
#define T5GSS1                        794
#define T5GVAL                        795
#define T5GGO_NOT_T5DONE              796
#define nT5DONE                       797
#define T5GGO_nT5DONE                 798
#define NOT_T5DONE                    799
#define T5GGO                         800
#define T5GSPM                        801
#define T5GTM                         802
#define T5GPOL                        803
#define TMR5GE                        804
#define T5CON                         805
#define TMR5ON                        806
#define T5CON_RD16                    807
#define RD165                         808
#define nT5SYNC                       809
#define NOT_T5SYNC                    810
#define SOSCEN5                       811
#define T5CON_SOSCEN                  812
#define T5CKPS                        813
#define T5CKPS0                       814
#define T5CKPS1                       815
#define TMR5CS0                       816
#define TMR5CS                        817
#define TMR5CS1                       818
#define TMR5L                         819
#define TMR5H                         820
#define EECON2                        821
#define EECON1                        822
#define RD                            823
#define WR                            824
#define WREN                          825
#define WRERR                         826
#define FREE                          827
#define CFGS                          828
#define EEFS                          829
#define EEPGD                         830
#define PORTA                         831
#define AN0                           832
#define ULPWUIN                       833
#define ULPWU                         834
#define RA0                           835
#define AN1                           836
#define RA1                           837
#define AN2                           838
#define RA2                           839
#define VREF_MINUS                    840
#define AN3                           841
#define VREF_PLUS                     842
#define RA3                           843
#define T0CKI                         844
#define RA4                           845
#define AN4                           846
#define T1CKI                         847
#define LVDIN                         848
#define RA5                           849
#define T3G                           850
#define HLVDIN                        851
#define CLKO                          852
#define RA6                           853
#define OSC2                          854
#define CLKI                          855
#define PORTA_RJPU                    856
#define RA7                           857
#define OSC1                          858
#define PORTB                         859
#define FLT0                          860
#define RB0                           861
#define INT0                          862
#define RB1                           863
#define INT1                          864
#define RB2                           865
#define INT2                          866
#define CTED1                         867
#define RB3                           868
#define CCP2_P2A                      869
#define INT3                          870
#define CCP2_PA2                      871
#define CTED2                         872
#define RB4                           873
#define KBI0                          874
#define PGM                           875
#define T3CKI                         876
#define RB5                           877
#define KBI1                          878
#define T1G                           879
#define PGC                           880
#define RB6                           881
#define KBI2                          882
#define PGD                           883
#define RB7                           884
#define KBI3                          885
#define PORTC                         886
#define SOSCO                         887
#define SCKLI                         888
#define RC0                           889
#define PORTC_CCP2                    890
#define PA2                           891
#define RC1                           892
#define SOSCI                         893
#define PORTC_P2A                     894
#define CCP1                          895
#define P1A                           896
#define PA1                           897
#define RC2                           898
#define SCK1                          899
#define SCL1                          900
#define RC3                           901
#define SDI1                          902
#define SDA1                          903
#define RC4                           904
#define SDO1                          905
#define RC5                           906
#define TX1                           907
#define RC6                           908
#define CK1                           909
#define RX1                           910
#define RC7                           911
#define DT1                           912
#define PORTD                         913
#define PSP0                          914
#define RD0                           915
#define CTPLS                         916
#define AD0                           917
#define PSP1                          918
#define RD1                           919
#define T5CKI                         920
#define T7G                           921
#define AD1                           922
#define PSP2                          923
#define RD2                           924
#define AD2                           925
#define PSP3                          926
#define RD3                           927
#define AD3                           928
#define PSP4                          929
#define RD4                           930
#define AD4                           931
#define SDO2                          932
#define PSP5                          933
#define RD5                           934
#define SDI2                          935
#define AD5                           936
#define SDA2                          937
#define SCK2                          938
#define PSP6                          939
#define RD6                           940
#define AD6                           941
#define SCL2                          942
#define SS2                           943
#define PSP7                          944
#define RD7                           945
#define NOT_SS2                       946
#define nSS2                          947
#define AD7                           948
#define PORTE                         949
#define P2D                           950
#define NOT_RD                        951
#define nRD                           952
#define PD2                           953
#define AD8                           954
#define RDE                           955
#define RE0                           956
#define P2C                           957
#define NOT_WR                        958
#define AD9                           959
#define nWR                           960
#define WRE                           961
#define RE1                           962
#define PC2                           963
#define P2B                           964
#define nCS                           965
#define NOT_CS                        966
#define CS                            967
#define CCP10                         968
#define PB2                           969
#define AD10                          970
#define RE2                           971
#define CCP9                          972
#define CCP9E                         973
#define P3C                           974
#define REFO                          975
#define AD11                          976
#define RE3                           977
#define PC3E                          978
#define PB3E                          979
#define CCP8                          980
#define P3B                           981
#define AD12                          982
#define RE4                           983
#define CCP8E                         984
#define CCP7                          985
#define P1C                           986
#define CCP7E                         987
#define AD13                          988
#define RE5                           989
#define PC1E                          990
#define CCP6E                         991
#define CCP6                          992
#define P1B                           993
#define AD14                          994
#define RE6                           995
#define PB1E                          996
#define CCP2E                         997
#define PORTE_P2A                     998
#define PA2E                          999
#define PORTE_CCP2                    1000
#define AD15                          1001
#define RE7                           1002
#define PORTF                         1003
#define C2OUTF                        1004
#define AN6                           1005
#define PORTF_C2OUT                   1006
#define RF1                           1007
#define CTDIN                         1008
#define PORTF_C1OUT                   1009
#define AN7                           1010
#define RF2                           1011
#define C1OUTF                        1012
#define AN8                           1013
#define RF3                           1014
#define CTMUI                         1015
#define C2INB                         1016
#define AN9                           1017
#define RF4                           1018
#define C2INA                         1019
#define C1INB                         1020
#define RF5                           1021
#define CVREF                         1022
#define AN10                          1023
#define C1INA                         1024
#define RF6                           1025
#define AN11                          1026
#define SS1                           1027
#define AN5                           1028
#define RF7                           1029
#define PORTG                         1030
#define CCP3                          1031
#define PA3                           1032
#define RG0                           1033
#define C3OUTG                        1034
#define PORTG_C3OUT                   1035
#define TX2                           1036
#define RG1                           1037
#define CK2                           1038
#define AN19                          1039
#define C3INA                         1040
#define RX2                           1041
#define RG2                           1042
#define DT2                           1043
#define AN18                          1044
#define CCP4                          1045
#define PD3                           1046
#define C3INB                         1047
#define RG3                           1048
#define AN17                          1049
#define CCP5                          1050
#define PD1                           1051
#define C3INC                         1052
#define T7CKI                         1053
#define T5G                           1054
#define RG4                           1055
#define RTCC                          1056
#define AN16                          1057
#define PORTG_RJPU                    1058
#define RG5                           1059
#define LATA                          1060
#define LATA0                         1061
#define LA0                           1062
#define LATA1                         1063
#define LA1                           1064
#define LATA2                         1065
#define LA2                           1066
#define LATA3                         1067
#define LA3                           1068
#define LATA4                         1069
#define LA4                           1070
#define LATA5                         1071
#define LA5                           1072
#define LATA6                         1073
#define LA6                           1074
#define LATA7                         1075
#define LA7                           1076
#define LATB                          1077
#define LB0                           1078
#define LATB0                         1079
#define LB1                           1080
#define LATB1                         1081
#define LB2                           1082
#define LATB2                         1083
#define LB3                           1084
#define LATB3                         1085
#define LB4                           1086
#define LATB4                         1087
#define LB5                           1088
#define LATB5                         1089
#define LB6                           1090
